Revit 2025 API
DoubleClickTarget Enumeration
 Elements that support double-click in Revit. Note that this is meant to cover cases where the element itself is a double-click target. Individual controls that are targets are handled separately.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum DoubleClickTarget
Public Enumeration DoubleClickTarget
public enum class DoubleClickTarget
type DoubleClickTarget
Members
Member name | Value | Description
Family | 0 |  Family instances
SketchedElement | 1 |  Sketch-based elements
ViewOnSheet | 2 |  Views on sheets
Assembly | 3 |  Assemblies
Group | 4 |  Groups
ComponentStairs | 5 |  Component-based stairs
OutsideViewOnSheet | 6 |  Outside active view on sheet
See Also
Reference
Autodesk.Revit.UI Namespace